import java.util.Scanner;

public class Task5 {
    //Напишите метод, который возвращает самую длинную из трех строк
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        System.out.println("Введите строку");
        String str1 = sc.nextLine();

    }

    private static String fenceLine(String str) {
        
    }
}